/**
 * 给stockchart的数据数组排序(时间轴上的顺序排列)
 * @param arr
 */
function seqcharSortarr(arr){
	if(arr && arr.length>0){
		arr.sort(function(a,b){
			return a[0]-b[0];
		});
	}
	return arr;
}

var testdata=[];
var datetime=new Date().getTime();
var time1=time2=datetime;
var intervalnum=1000*24*60;
function toPoint(val,pos){
	var fix=Math.pow(10,pos);
	return Math.round(val*fix)/fix;
}
for(var i=0;i<10;i++){
	time1+= intervalnum;
	var tmpobj1={"过程1":toPoint(Math.random()*100,2),"过程2":toPoint(Math.random()*100,2),"来源":"A","时刻":time1},
	tmpobj2={"过程1":toPoint(Math.random()*100,2),"过程2":toPoint(Math.random()*100,2),"来源":"B","时刻":time1};
	testdata.push(tmpobj1);
	testdata.push(tmpobj2);
}
var aSeqDefaultChartData=[{name:"line1",data:
	[
		/* May 2006 */
		[1147651200000,376.20],
		[1147737600000,371.30],
		[1147824000000,374.50],
		[1147910400000,370.99],
		[1147996800000,370.02],
		[1148256000000,370.95],
		[1148342400000,375.58],
		[1148428800000,381.25],
		[1148515200000,382.99],
		[1148601600000,381.35],
		[1148947200000,371.94],
		[1149033600000,371.82]
		]},
		{name:"line2",data:[
		/* May 2006 */
		[1147651200000,67.79],
		[1147737600000,64.98],
		[1147824000000,65.26],
		[1147910400000,63.18],
		[1147996800000,64.51],
		[1148256000000,63.38],
		[1148342400000,63.15],
		[1148428800000,63.34],
		[1148515200000,64.33],
		[1148601600000,63.55],
		[1148947200000,61.22],
		[1149033600000,59.77]
		]},
		{name:"line3",data:
		[
		[1147651200000,23.15],
		[1147737600000,23.01],
		[1147824000000,22.73],
		[1147910400000,22.83],
		[1147996800000,22.56],
		[1148256000000,22.88],
		[1148342400000,22.79],
		[1148428800000,23.50],
		[1148515200000,23.74],
		[1148601600000,23.72],
		[1148947200000,23.15],
		[1149033600000,22.65]
		]}];