/**
 * Created with JetBrains WebStorm.
 * User: MARKELUO
 * Date: 13-8-17
 * Time: 上午9:46
 * To change this template use File | Settings | File Templates.
 */
var TestData={
    DataList:{"result":"true","Data":{"DataSet":[
        {
            "ID":"SIGDS",
            "Memo":"",
            "DataSource":"lwltest",
            "VirtualTable":"SIGChart",
            "DefaultVisualContrl":"DropDownList",
            "Level":"0",
            "Parent":"root",
            "Columns":{"DataColumns":{"DataColumn":[{"ID":"班次","DataType":"VARCHAR","Aggregator":"","GroupBy":"false","Visible":"true"},{"ID":"重量","DataType":"VARCHAR","Aggregator":"","GroupBy":"false","Visible":"true"}]},"CalColumns":{"CalColumn":[]}},"ClumnOrder":{"ColumnName":["班次","重量"]},"SortingRules":{"ColumnName":[]}},{"ID":"SIGDS2","Memo":"","DataSource":"lwltest","VirtualTable":"SIGChart","DefaultVisualContrl":"DropDownList","Level":"0","Parent":"root","Columns":{"DataColumns":{"DataColumn":[{"ID":"班次","DataType":"VARCHAR","Aggregator":"","GroupBy":"false","Visible":"true"},{"ID":"重量","DataType":"VARCHAR","Aggregator":"","GroupBy":"false","Visible":"true"}]},"CalColumns":{"CalColumn":[]}},"ClumnOrder":{"ColumnName":["班次","重量"]},"SortingRules":{"ColumnName":[]}}],"groups":[{"ID":"GROUP","path":71}]},"message":"获取成功"},
    VTValue:{"result":"true","virtualTableData":{"data":{"vtName":"SIGChart","dataSourceName":"lwltest","sqlString":"select shift as 班次,mat_mass as 重量 from  ipc_spc_qm_IMR","para":[],"schema":["班次","重量"],"data1":""}},"datasetData":{"data":{"DataSet":{"ID":"SIGDS","Memo":"","DataSource":"lwltest","VirtualTable":"SIGChart","DefaultVisualContrl":"DropDownList","Level":"0","Parent":"root","Columns":{"DataColumns":{"DataColumn":[{"ID":"班次","DataType":"VARCHAR","Aggregator":"","GroupBy":"false","Visible":"true"},{"ID":"重量","DataType":"VARCHAR","Aggregator":"","GroupBy":"false","Visible":"true"}]},"CalColumns":{"CalColumn":[]}},"ClumnOrder":{"ColumnName":["班次","重量"]},"SortingRules":{"ColumnName":[]}}}},"message":"获取数据成功"},
    DataSet:{"result":"true","Data":[{"班次":"丁班","重量":"29732.03"},{"班次":"丁班","重量":"28887.18"},{"班次":"丁班","重量":"28893.53"},{"班次":"丁班","重量":"28312.92"},{"班次":"丁班","重量":"28892.96"},{"班次":"丁班","重量":"28262.88"},{"班次":"丁班","重量":"28878.9"},{"班次":"丁班","重量":"29855.93"},{"班次":"丁班","重量":"29178.88"},{"班次":"丁班","重量":"29675.98"},{"班次":"丁班","重量":"29214.39"},{"班次":"丁班","重量":"29832.14"},{"班次":"丁班","重量":"29209.27"},{"班次":"丁班","重量":"29762.58"},{"班次":"丁班","重量":"29227.4"},{"班次":"丁班","重量":"29534.45"},{"班次":"丁班","重量":"28821.54"},{"班次":"丁班","重量":"29366.21"},{"班次":"丁班","重量":"29118.57"},{"班次":"丁班","重量":"29419.13"},{"班次":"丁班","重量":"29106.86"},{"班次":"丁班","重量":"29496.9"},{"班次":"丁班","重量":"29639.05"},{"班次":"乙班","重量":"30397"},{"班次":"丁班","重量":"21040.32"},{"班次":"丁班","重量":"28904.81"},{"班次":"丁班","重量":"29286.34"},{"班次":"丁班","重量":"28633.89"},{"班次":"丁班","重量":"29249.79"},{"班次":"丁班","重量":"28860.52"},{"班次":"丁班","重量":"29253.84"},{"班次":"丁班","重量":"28947.61"},{"班次":"丁班","重量":"29344.76"},{"班次":"丁班","重量":"28998.67"},{"班次":"丁班","重量":"29112.63"},{"班次":"丁班","重量":"29141.41"},{"班次":"丁班","重量":"29377.44"},{"班次":"丁班","重量":"28996.72"},{"班次":"丁班","重量":"29531.72"},{"班次":"丁班","重量":"25754.75"},{"班次":"丁班","重量":"21979.54"},{"班次":"丁班","重量":"28655.69"},{"班次":"丁班","重量":"25345.32"},{"班次":"丁班","重量":"25429.45"},{"班次":"乙班","重量":"29425.33"},{"班次":"乙班","重量":"30535.54"},{"班次":"乙班","重量":"29813.21"},{"班次":"乙班","重量":"30569.04"},{"班次":"乙班","重量":"30470.77"},{"班次":"乙班","重量":"30297.72"},{"班次":"乙班","重量":"29280.75"},{"班次":"乙班","重量":"30418.51"},{"班次":"乙班","重量":"29589.39"},{"班次":"乙班","重量":"30471.27"},{"班次":"丁班","重量":"24914.13"},{"班次":"丁班","重量":"25383.88"},{"班次":"丁班","重量":"24913.75"},{"班次":"丁班","重量":"25405.21"},{"班次":"乙班","重量":"30618.67"},{"班次":"乙班","重量":"28955.82"},{"班次":"乙班","重量":"30544.32"},{"班次":"乙班","重量":"29326.12"},{"班次":"乙班","重量":"30289.79"},{"班次":"乙班","重量":"29168.58"},{"班次":"乙班","重量":"30550.94"},{"班次":"乙班","重量":"29317.78"},{"班次":"乙班","重量":"30440.23"},{"班次":"乙班","重量":"29365.62"},{"班次":"乙班","重量":"30404.86"},{"班次":"乙班","重量":"29680.51"},{"班次":"乙班","重量":"30575.39"},{"班次":"乙班","重量":"29498.12"},{"班次":"乙班","重量":"30676.34"},{"班次":"乙班","重量":"29569.86"},{"班次":"乙班","重量":"30441.72"},{"班次":"乙班","重量":"29498.22"},{"班次":"乙班","重量":"31007.97"},{"班次":"乙班","重量":"30267.82"},{"班次":"乙班","重量":"31080.11"},{"班次":"乙班","重量":"30337.66"},{"班次":"乙班","重量":"31331.3"},{"班次":"乙班","重量":"30271.44"},{"班次":"乙班","重量":"30927.26"},{"班次":"乙班","重量":"29725.13"},{"班次":"乙班","重量":"30762.02"},{"班次":"乙班","重量":"29768.29"},{"班次":"乙班","重量":"28432.32"},{"班次":"乙班","重量":"32372.88"},{"班次":"乙班","重量":"29641.79"},{"班次":"乙班","重量":"32232.31"},{"班次":"乙班","重量":"28529.16"},{"班次":"乙班","重量":"31225.68"},{"班次":"乙班","重量":"29047.59"},{"班次":"乙班","重量":"30900.24"},{"班次":"乙班","重量":"29032.77"},{"班次":"乙班","重量":"30712"},{"班次":"乙班","重量":"28972.98"},{"班次":"乙班","重量":"30687.93"},{"班次":"乙班","重量":"30745.62"},{"班次":"乙班","重量":"29375.41"}],"message":"获取数据成功"},
    //R计算结果
    VplotData:{"result":"true","name":["丁班","乙班"],"singleValue_data":[{"values":[29732.03,28887.18,28893.53,28312.92,28892.96,28262.88,28878.9,29855.93,29178.88,29675.98,29214.39,29832.14,29209.27,29762.58,29227.4,29534.45,28821.54,29366.21,29118.57,29419.13,29106.86,29496.9,29639.05,21040.32,28904.81,29286.34,28633.89,29249.79,28860.52,29253.84,28947.61,29344.76,28998.67,29112.63,29141.41,29377.44,28996.72,29531.72,25754.75,21979.54,28655.69,25345.32,25429.45,24914.13,25383.88,24913.75,25405.21],"UCL":31276.479,"xBar":28271.955,"LCL":25267.43},{"values":[30397,29425.33,30535.54,29813.21,30569.04,30470.77,30297.72,29280.75,30418.51,29589.39,30471.27,30618.67,28955.82,30544.32,29326.12,30289.79,29168.58,30550.94,29317.78,30440.23,29365.62,30404.86,29680.51,30575.39,29498.12,30676.34,29569.86,30441.72,29498.22,31007.97,30267.82,31080.11,30337.66,31331.3,30271.44,30927.26,29725.13,30762.02,29768.29,28432.32,32372.88,29641.79,32232.31,28529.16,31225.68,29047.59,30900.24,29032.77,30712,28972.98,30687.93,30745.62,29375.41],"UCL":33531.46,"xBar":30143.002,"LCL":26754.544}],"MR_data":[{"values":[844.85,6.35,580.61,580.04,630.08,616.02,977.03,677.05,497.1,461.59,617.75,622.87,553.31,535.18,307.05,712.91,544.67,247.64,300.56,312.27,390.04,142.15,8598.73,7864.49,381.53,652.45,615.9,389.27,393.32,306.23,397.15,346.09,113.96,28.78,236.03,380.72,535,3776.97,3775.21,6676.15,3310.37,84.13,515.32,469.75,470.13,491.46],"UCL":3691.059,"MRBar":1129.701,"LCL":0},{"values":[971.67,1110.21,722.33,755.83,98.27,173.05,1016.97,1137.76,829.12,881.88,147.4,1662.85,1588.5,1218.2,963.67,1121.21,1382.36,1233.16,1122.45,1074.61,1039.24,724.35,894.88,1077.27,1178.22,1106.48,871.86,943.5,1509.75,740.15,812.29,742.45,993.64,1059.86,655.82,1202.13,1036.89,993.73,1335.97,3940.56,2731.09,2590.52,3703.15,2696.52,2178.09,1852.65,1867.47,1679.23,1739.02,1714.95,57.69,1370.21],"UCL":4162.721,"MRBar":1274.06,"LCL":0}],"message":"计算成功"},
    //报警异常点原因列表(从服务器获取)
    ErrorList:{
        'data':
            [{'no':1,'name':'分类1','items':
                [  {'no':11,'name':'分类11','items':[{'no':111,'name':'分类111','items':[]}]},
                    {'no':12,'name':'分类12','items':[{'no':121,'name':'分类121','items':[]}]}
                ]
            },
                {
                    'no':2,
                    'name':'分类2',
                    'items':
                    [
                    {'no':21,'name':'分类21','items':[{'no':211,'name':'分类211','items':[]}]},
                    {'no':22,'name':'分类22','items':[{'no':221,'name':'分类221','items':[]}]}
                    ]
                }
            ]
    }
}